TexasInstruments/mspm0-sdk/source/ti/driverlib/dl_timer.h
/** @addtogroup DL_TIMER_CCP2_DIS_OUT_ADV
 *  @{
 */
/**
 *  @brief CCP2 output is forced low when timer is disabled
 */
#define DL_TIMER_CCP2_DIS_OUT_ADV_FORCE_LOW (GPTIMER_ODIS_C0CCP2_CCP_OUTPUT_LOW)

/**
 *  @brief CCP2 output is set by the OCTL when timer is disabled
 */
#define DL_TIMER_CCP2_DIS_OUT_ADV_SET_BY_OCTL \
                                           (GPTIMER_ODIS_C0CCP2_CCP_OUTPUT_OCTL)
/** @}*/

/** @addtogroup DL_TIMER_CCP3_DIS_OUT_ADV
 *  @{
 */

/**
 *  @brief CCP3 output is forced low when timer is disabled
 */
#define DL_TIMER_CCP3_DIS_OUT_ADV_FORCE_LOW (GPTIMER_ODIS_C0CCP3_CCP_OUTPUT_LOW)

/**
 *  @brief CCP3 output is set by the OCTL when timer is disabled
 */
#define DL_TIMER_CCP3_DIS_OUT_ADV_SET_BY_OCTL \
                                           (GPTIMER_ODIS_C0CCP3_CCP_OUTPUT_OCTL)
/** @}*/

/* clang-format on */

/*! @enum DL_TIMER_CLOCK */
typedef enum {
    /*! Selects BUSCLK as clock source */
    DL_TIMER_CLOCK_BUSCLK = GPTIMER_CLKSEL_BUSCLK_SEL_ENABLE,
    /*! Selects 2X BUSCLK as clock source */
    DL_TIMER_CLOCK_2X_BUSCLK = GPTIMER_CLKSEL_BUS2XCLK_SEL_ENABLE,
    /*! Selects MFCLK as clock source */
    DL_TIMER_CLOCK_MFCLK = GPTIMER_CLKSEL_MFCLK_SEL_ENABLE,
    /*! Selects LFCLK as clock source */
    DL_TIMER_CLOCK_LFCLK = GPTIMER_CLKSEL_LFCLK_SEL_ENABLE,
    /*! Disables selected clock source */
    DL_TIMER_CLOCK_DISABLE = GPTIMER_CLKSEL_LFCLK_SEL_DISABLE,
} DL_TIMER_CLOCK;

/*! @enum  DL_TIMER_CLOCK_DIVIDE */
typedef enum {
    /*! Timer source clock divide ratio set to 1 */
    DL_TIMER_CLOCK_DIVIDE_1 = GPTIMER_CLKDIV_RATIO_DIV_BY_1,
    /*! Timer source clock divide ratio set to 2 */
    DL_TIMER_CLOCK_DIVIDE_2 = GPTIMER_CLKDIV_RATIO_DIV_BY_2,
    /*! Timer source clock divide ratio set to 3 */
    DL_TIMER_CLOCK_DIVIDE_3 = GPTIMER_CLKDIV_RATIO_DIV_BY_3,
    /*! Timer source clock divide ratio set to 4 */
    DL_TIMER_CLOCK_DIVIDE_4 = GPTIMER_CLKDIV_RATIO_DIV_BY_4,
    /*! Timer source clock divide ratio set to 5 */
    DL_TIMER_CLOCK_DIVIDE_5 = GPTIMER_CLKDIV_RATIO_DIV_BY_5,
    /*! Timer source clock divide ratio set to 6 */
    DL_TIMER_CLOCK_DIVIDE_6 = GPTIMER_CLKDIV_RATIO_DIV_BY_6,
    /*! Timer source clock divide ratio set to 7 */
    DL_TIMER_CLOCK_DIVIDE_7 = GPTIMER_CLKDIV_RATIO_DIV_BY_7,
    /*! Timer source clock divide ratio set to 8 */
    DL_TIMER_CLOCK_DIVIDE_8 = GPTIMER_CLKDIV_RATIO_DIV_BY_8,
} DL_TIMER_CLOCK_DIVIDE;

/*! @enum  DL_TIMER_CCP_DIS_OUT */
typedef enum {
    /*! CCP output source is disabled and driven low before conditional
     * inversion */
    DL_TIMER_CCP_DIS_OUT_LOW = GPTIMER_ODIS_C0CCP0_CCP_OUTPUT_LOW,
    /*! CCP output source is not disabled */
    DL_TIMER_CCP_DIS_OUT_SET_BY_OCTL = GPTIMER_ODIS_C0CCP0_CCP_OUTPUT_OCTL,
} DL_TIMER_CCP_DIS_OUT;

/*! @enum  DL_TIMER_CC_INDEX */
typedef enum {
    /*! Index associated to Capture Compare 0 */
    DL_TIMER_CC_0_INDEX = 0,
    /*! Index associated to Capture Compare 1 */
    DL_TIMER_CC_1_INDEX = 1,
    /*! Index associated to Capture Compare 2 */
    DL_TIMER_CC_2_INDEX = 2,
    /*! Index associated to Capture Compare 3 */
    DL_TIMER_CC_3_INDEX = 3,

    /*! Index associated to Capture Compare 4 */
    DL_TIMER_CC_4_INDEX = 4,
    /*! Index associated to Capture Compare 5 */
    DL_TIMER_CC_5_INDEX = 5,

} DL_TIMER_CC_INDEX;

/*! @enum  DL_TIMER_EXT_TRIG_SEL*/
typedef enum {
    /*! External trigger 0 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_0 = GPTIMER_TSEL_ETSEL_TRIG0,
    /*! External trigger 1 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_1 = GPTIMER_TSEL_ETSEL_TRIG1,
    /*! External trigger 2 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_2 = GPTIMER_TSEL_ETSEL_TRIG2,
    /*! External trigger 3 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_3 = GPTIMER_TSEL_ETSEL_TRIG3,
    /*! External trigger 4 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_4 = GPTIMER_TSEL_ETSEL_TRIG4,
    /*! External trigger 5 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_5 = GPTIMER_TSEL_ETSEL_TRIG5,
    /*! External trigger 6 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_6 = GPTIMER_TSEL_ETSEL_TRIG6,
    /*! External trigger 7 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_7 = GPTIMER_TSEL_ETSEL_TRIG7,
    /*! External trigger 8 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_8 = GPTIMER_TSEL_ETSEL_TRIG8,
    /*! External trigger 9 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_9 = GPTIMER_TSEL_ETSEL_TRIG9,
    /*! External trigger 10 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_10 = GPTIMER_TSEL_ETSEL_TRIG10,
    /*! External trigger 11 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_11 = GPTIMER_TSEL_ETSEL_TRIG11,
    /*! External trigger 12 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_12 = GPTIMER_TSEL_ETSEL_TRIG12,
    /*! External trigger 13 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_13 = GPTIMER_TSEL_ETSEL_TRIG13,
    /*! External trigger 14 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_14 = GPTIMER_TSEL_ETSEL_TRIG14,
    /*! External trigger 15 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_15 = GPTIMER_TSEL_ETSEL_TRIG15,
    /*! External event subscriber 0 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_SUB_0 = GPTIMER_TSEL_ETSEL_TRIG_SUB0,
    /*! External event subscriber 1 */
    DL_TIMER_EXT_TRIG_SEL_TRIG_SUB_1 = GPTIMER_TSEL_ETSEL_TRIG_SUB1,
} DL_TIMER_EXT_TRIG_SEL;

/*! @enum  DL_TIMER_TIMER_MODE */
typedef enum {
    /*! Configures Timer in one shot mode in DOWN COUNTING mode */
    DL_TIMER_TIMER_MODE_ONE_SHOT =
        (GPTIMER_CTRCTL_CM_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_0),
    /*! Configures Timer in periodic mode in DOWN COUNTING mode */
    DL_TIMER_TIMER_MODE_PERIODIC =
        (GPTIMER_CTRCTL_CM_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_1),
    /*! Configures Timer in one shot mode in UP COUNTING mode */
    DL_TIMER_TIMER_MODE_ONE_SHOT_UP =
        (GPTIMER_CTRCTL_CM_UP | GPTIMER_CTRCTL_REPEAT_REPEAT_0),
    /*! Configures Timer in periodic mode in UP COUNTING mode */
    DL_TIMER_TIMER_MODE_PERIODIC_UP =
        (GPTIMER_CTRCTL_CM_UP | GPTIMER_CTRCTL_REPEAT_REPEAT_1),
    /*! Configures Timer in one shot mode in UP/DOWN COUNTING mode */
    DL_TIMER_TIMER_MODE_ONE_SHOT_UP_DOWN =
        (GPTIMER_CTRCTL_CM_UP_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_0),
    /*! Configures Timer in periodic mode in UP/DOWN COUNTING mode */
    DL_TIMER_TIMER_MODE_PERIODIC_UP_DOWN =
        (GPTIMER_CTRCTL_CM_UP_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_1),
} DL_TIMER_TIMER_MODE;

/*! @enum  DL_TIMER_CAPTURE_MODE */
typedef enum {
    /*! Configures Timer in edge time capture mode and timer is configured
     *! in down counting mode */
    DL_TIMER_CAPTURE_MODE_EDGE_TIME,
    /*! Configures Timer in period capture mode and timer is configured
     *! in down counting mode */
    DL_TIMER_CAPTURE_MODE_PERIOD_CAPTURE,
    /*! Configures Timer in pulse width capture mode and timer is configured
     *! in down counting mode */
    DL_TIMER_CAPTURE_MODE_PULSE_WIDTH,
    /*! Configures Timer in edge time capture mode and timer is configured
     *! in up counting mode */
    DL_TIMER_CAPTURE_MODE_EDGE_TIME_UP,
    /*! Configures Timer in period capture mode and timer is configured
     *! in up counting mode */
    DL_TIMER_CAPTURE_MODE_PERIOD_CAPTURE_UP,
    /*! Configures Timer in pulse width capture mode and timer is configured
     *! in up counting mode */
    DL_TIMER_CAPTURE_MODE_PULSE_WIDTH_UP,
} DL_TIMER_CAPTURE_MODE;

/*! @enum  DL_TIMER_CAPTURE_COMBINED_MODE */
typedef enum {
    /*! Configures Timer in pulse width and period mode and timer is configured
     *! in down counting mode */
    DL_TIMER_CAPTURE_COMBINED_MODE_PULSE_WIDTH_AND_PERIOD,
    /*! Configures Timer in pulse width and period mode and timer is configured
     *! in up counting mode */
    DL_TIMER_CAPTURE_COMBINED_MODE_PULSE_WIDTH_AND_PERIOD_UP,
} DL_TIMER_CAPTURE_COMBINED_MODE;

/*! @enum  DL_TIMER_COMPARE_MODE */
typedef enum {
    /*! Configures Timer in edge count mode and timer is configured
     *! in down counting mode */
    DL_TIMER_COMPARE_MODE_EDGE_COUNT,
    /*! Configures Timer in edge count mode and timer is configured
     *! in up counting mode */
    DL_TIMER_COMPARE_MODE_EDGE_COUNT_UP,
    /*! Configures Timer in edge count mode and timer is configured
     *! in up/down counting mode */
    DL_TIMER_COMPARE_MODE_EDGE_COUNT_UP_DOWN,
} DL_TIMER_COMPARE_MODE;

/*! @enum  DL_TIMER_COUNT_MODE */
typedef enum {
    /*! Timer counts in DOWN mode */
    DL_TIMER_COUNT_MODE_DOWN = GPTIMER_CTRCTL_CM_DOWN,
    /*! Timer counts in UP/DOWN mode */
    DL_TIMER_COUNT_MODE_UP_DOWN = GPTIMER_CTRCTL_CM_UP_DOWN,
    /*! Timer counts in UP mode */
    DL_TIMER_COUNT_MODE_UP = GPTIMER_CTRCTL_CM_UP,
} DL_TIMER_COUNT_MODE;

/*! @enum  DL_TIMER */
typedef enum {
    /*! Start running timer */
    DL_TIMER_START = GPTIMER_CTRCTL_EN_ENABLED,
    /*! Don't start running timer */
    DL_TIMER_STOP = GPTIMER_CTRCTL_EN_DISABLED,
} DL_TIMER;

/*! @enum DL_TIMER_INTERM_INT */
typedef enum {

    /*! Enables intermediate interrupt in timer mode */
    DL_TIMER_INTERM_INT_ENABLED = GPTIMER_CCCTL_01_COC_COMPARE,
    /*! Disabled intermediate interrupt in timer mode */
    DL_TIMER_INTERM_INT_DISABLED = GPTIMER_CCCTL_01_COC_CAPTURE,

